In [73]:
import pandas as pd 

df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [74]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [75]:
df["Name"][0:10]

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [76]:
s = df["Name"][0:10]

In [77]:
#creating list which contains new index
l = ["a","b","c","d","e","f","g","h","i","j"]

In [78]:
pd.Series(s,index=l)

a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
f    NaN
g    NaN
h    NaN
i    NaN
j    NaN
Name: Name, dtype: object

In [79]:
pd.Series(list(s),index=l)  # s must be in list()

a                              Braund, Mr. Owen Harris
b    Cumings, Mrs. John Bradley (Florence Briggs Th...
c                               Heikkinen, Miss. Laina
d         Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                             Allen, Mr. William Henry
f                                     Moran, Mr. James
g                              McCarthy, Mr. Timothy J
h                       Palsson, Master. Gosta Leonard
i    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
j                  Nasser, Mrs. Nicholas (Adele Achem)
dtype: object

In [80]:
s1 = pd.Series(list(s),index = l)

In [81]:
print( s[0] )
print( s1["a"] )
print( s1[0] )

Braund, Mr. Owen Harris
Braund, Mr. Owen Harris
Braund, Mr. Owen Harris

s[0] ,s1["a] And s1[0] gives same output , yes we cahnge index but python cant forgot internal indexing

In [84]:
data =[
    'Aarav',
    'Vivaan',
    'Aditya',
    'Ishaan',
    'Ananya',
    'Saanvi',
    'Kritika',
    'Rohan',
    'Neha',
    'Aisha'
]

s2 = pd.Series(data)
s2

0      Aarav
1     Vivaan
2     Aditya
3     Ishaan
4     Ananya
5     Saanvi
6    Kritika
7      Rohan
8       Neha
9      Aisha
dtype: object

In [88]:
s3 = pd.concat([s1,s2])
s3

a                              Braund, Mr. Owen Harris
b    Cumings, Mrs. John Bradley (Florence Briggs Th...
c                               Heikkinen, Miss. Laina
d         Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                             Allen, Mr. William Henry
f                                     Moran, Mr. James
g                              McCarthy, Mr. Timothy J
h                       Palsson, Master. Gosta Leonard
i    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
j                  Nasser, Mrs. Nicholas (Adele Achem)
0                                                Aarav
1                                               Vivaan
2                                               Aditya
3                                               Ishaan
4                                               Ananya
5                                               Saanvi
6                                              Kritika
7                                                Rohan
8                                                 Neha
9                                                Aisha
dtype: object

In [89]:
s3[0]

'Aarav'

In [94]:
s3["g":4]

g                              McCarthy, Mr. Timothy J
h                       Palsson, Master. Gosta Leonard
i    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
j                  Nasser, Mrs. Nicholas (Adele Achem)
0                                                Aarav
1                                               Vivaan
2                                               Aditya
3                                               Ishaan
4                                               Ananya
dtype: object

In [95]:
s1*s2  # all shows Nan bcoz ,index of values are diffrant

a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
f    NaN
g    NaN
h    NaN
i    NaN
j    NaN
0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

In [102]:
x1= pd.Series( [10,11,12,13,14,15],index=[1,0,4,6,3,2])
x2= pd.Series( [10,10,10,10,10,10],index=[0,1,2,3,4,5])

print(x1)
print(x2)

1    10
0    11
4    12
6    13
3    14
2    15
dtype: int64
0    10
1    10
2    10
3    10
4    10
5    10
dtype: int64

In [101]:
x1*x2  # same index values only multiply

0    110.0
1    100.0
2    150.0
3    140.0
4    120.0
5      NaN
6      NaN
dtype: float64